Revit 2027 API
ViewCropRegionShapeManager.IsSplitHorizontally Property
 Whether or not the view's crop is split (and the split is horizontal).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSplitHorizontally { get; }
Public ReadOnly Property IsSplitHorizontally As Boolean
	Get
public:
property bool IsSplitHorizontally {
	bool get ();
}
member IsSplitHorizontally : bool with get
Property Value
Boolean
See Also
Reference
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace